# Palmer Penguins
***
<div style="clip-path: inset(15% 0% 5% 0%); width: 100%; height: auto;">
    <img src="https://lauranavarroviz.files.wordpress.com/2020/08/penguinsbill_plot_final.png" style="width: 80%;">
</div>


This notebook contains my analysis of the famos palmer penguins dataset.

The dataset aviable [on Github](https://github.com/ShamansIT/Data_Analytics_Research_Project).

## Imports
***
Use pandas for the DataFrame data structure. 

It allows us to investigate CSV files amongst amongst other features!

In [2]:
#Data frames import
import pandas as pd

## Load Data
***
Load the palmer penguins data set from a URL.

In [3]:
#Loads the pinguins dataset
df = pd.read_csv("https://raw.githubusercontent.com/mwaskom/seaborn-data/master/penguins.csv")

In [4]:
#First look for import data
df

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE
...,...,...,...,...,...,...,...
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,FEMALE
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,MALE
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,FEMALE
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,MALE

# Palmer Penguins
***
<div style="clip-path: inset(15% 0% 5% 0%); width: 100%; height: auto;">
    <img src="https://lauranavarroviz.files.wordpress.com/2020/08/penguinsbill_plot_final.png" style="width: 80%;">
</div>


This notebook contains my analysis of the famos palmer penguins dataset.

The dataset aviable [on Github](https://github.com/ShamansIT/Data_Analytics_Research_Project).

## Inspect Data
***

In [5]:
#Look at the first row
df.iloc[0]

species                 Adelie
island               Torgersen
bill_length_mm            39.1
bill_depth_mm             18.7
flipper_length_mm        181.0
body_mass_g             3750.0
sex                       MALE
Name: 0, dtype: object

In [6]:
#Sex of penguins
df['sex']

0        MALE
1      FEMALE
2      FEMALE
3         NaN
4      FEMALE
        ...
339       NaN
340    FEMALE
341      MALE
342    FEMALE
343      MALE
Name: sex, Length: 344, dtype: object

In [7]:
#Count a number of penguins each of sex
df['sex'].value_counts()

sex
MALE      168
FEMALE    165
Name: count, dtype: int64

In [8]:
#Describe the data set
df.describe()

       bill_length_mm  bill_depth_mm  flipper_length_mm  body_mass_g
count      342.000000     342.000000         342.000000   342.000000
mean        43.921930      17.151170         200.915205  4201.754386
std          5.459584       1.974793          14.061714   801.954536
min         32.100000      13.100000         172.000000  2700.000000
25%         39.225000      15.600000         190.000000  3550.000000
50%         44.450000      17.300000         197.000000  4050.000000
75%         48.500000      18.700000         213.000000  4750.000000
max         59.600000      21.500000         231.000000  6300.000000

In [9]:
# All data inspection head
df.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE

In [10]:
# Print data info for future modeling data
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 344 entries, 0 to 343
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   species            344 non-null    object
 1   island             344 non-null    object
 2   bill_length_mm     342 non-null    float64
 3   bill_depth_mm      342 non-null    float64
 4   flipper_length_mm  342 non-null    float64
 5   body_mass_g        342 non-null    float64
 6   sex                333 non-null    object
dtypes: float64(4), object(3)
memory usage: 18.9+ KB

# Data modeling
***

In [11]:
# Print Species unique value
df['species'].unique()

array(['Adelie', 'Chinstrap', 'Gentoo'], dtype=object)

In [12]:
# Species object modify to category
df['species'] = df['species'].astype('category')

In [13]:
# Show Species category
df['species']

0      Adelie
1      Adelie
2      Adelie
3      Adelie
4      Adelie
        ...
339    Gentoo
340    Gentoo
341    Gentoo
342    Gentoo
343    Gentoo
Name: species, Length: 344, dtype: category
Categories (3, object): ['Adelie', 'Chinstrap', 'Gentoo']

In [14]:
# Print Island unique value
df['island'].unique()

array(['Torgersen', 'Biscoe', 'Dream'], dtype=object)

In [15]:
# Island object modify to category
df['island'] = df['island'].astype('category')

In [16]:
# Show Island category
df['island']

0      Torgersen
1      Torgersen
2      Torgersen
3      Torgersen
4      Torgersen
         ...
339       Biscoe
340       Biscoe
341       Biscoe
342       Biscoe
343       Biscoe
Name: island, Length: 344, dtype: category
Categories (3, object): ['Biscoe', 'Dream', 'Torgersen']

In [17]:
# Print Sex unique value
df['sex'].unique()

array(['MALE', 'FEMALE', nan], dtype=object)

In [18]:
# Sex object modify to category
df['sex'] = df['sex'].astype('category')

In [19]:
# Show Sex category
df['sex']

0        MALE
1      FEMALE
2      FEMALE
3         NaN
4      FEMALE
        ...
339       NaN
340    FEMALE
341      MALE
342    FEMALE
343      MALE
Name: sex, Length: 344, dtype: category
Categories (2, object): ['FEMALE', 'MALE']

In [20]:
# Show all data after modify
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 344 entries, 0 to 343
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   species            344 non-null    category
 1   island             344 non-null    category
 2   bill_length_mm     342 non-null    float64
 3   bill_depth_mm      342 non-null    float64
 4   flipper_length_mm  342 non-null    float64
 5   body_mass_g        342 non-null    float64
 6   sex                333 non-null    category
dtypes: category(3), float64(4)
memory usage: 12.3 KB

In [21]:
# Renaming columns
df.rename(columns={
    'species' : "Species",
    'island' : "Island",
    'bill_length_mm': 'Bill Length (mm)',
    'bill_depth_mm': 'Bill Depth (mm)',
    'flipper_length_mm': 'Flipper Length (mm)',
    'body_mass_g': 'Body Mass (g)',
    'sex': 'Sex'
}, inplace=True)

In [22]:
# Show
df.head()

,Species,Island,Bill Length (mm),Bill Depth (mm),Flipper Length (mm),Body Mass (g),Sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE

## Missing data
---

In [23]:
# Show missing 
df.isnull().sum()

Species                 0
Island                  0
Bill Length (mm)        2
Bill Depth (mm)         2
Flipper Length (mm)     2
Body Mass (g)           2
Sex                    11
dtype: int64

In [24]:
# Show all data missing rows
df[df.isnull().any(axis=1)]

,Species,Island,Bill Length (mm),Bill Depth (mm),Flipper Length (mm),Body Mass (g),Sex
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
8,Adelie,Torgersen,34.1,18.1,193.0,3475.0,NaN
9,Adelie,Torgersen,42.0,20.2,190.0,4250.0,NaN
10,Adelie,Torgersen,37.8,17.1,186.0,3300.0,NaN
11,Adelie,Torgersen,37.8,17.3,180.0,3700.0,NaN
47,Adelie,Dream,37.5,18.9,179.0,2975.0,NaN
246,Gentoo,Biscoe,44.5,14.3,216.0,4100.0,NaN
286,Gentoo,Biscoe,46.2,14.4,214.0,4650.0,NaN
324,Gentoo,Biscoe,47.3,13.8,216.0,4725.0,NaN
336,Gentoo,Biscoe,44.5,15.7,217.0,4875.0,NaN
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN

There are 10 rows that contain missing values, constituting less 3% of the dataset. These rows will be excluded from the analysis.

In [25]:
# Drop all rows with missing data
df.dropna(inplace=True)

## Bill dimensions Tables
***

In [26]:
def penguin_sum_table_model (group_cols, value_cols):
    """
    Displays a summary table showing the average values of value_cols, grouped according to group_cols.
    
    Parameters
    ----------
    group_cols : list of strings, columns to be grouped
    value_cols : list of strings, columns to be analyzed
    
    Return
    ----------
    pandas.DataFrame
    """
    
    return df.groupby(group_cols)[value_cols].mean().round(2)

In [27]:
# Generate a summary table
sum_table = penguin_sum_table_model(["Species","Sex"], ["Bill Length (mm)", "Bill Depth (mm)"])

In [28]:
# Show summary table
sum_table

                  Bill Length (mm)  Bill Depth (mm)
Species   Sex
Adelie    FEMALE             37.26            17.62
          MALE               40.39            19.07
Chinstrap FEMALE             46.57            17.59
          MALE               51.09            19.25
Gentoo    FEMALE             45.56            14.24
          MALE               49.47            15.72

## Species size Table
***

In [31]:
# Create pivot table(pandas)
pivot_size_table = pd.pivot_table(df,values= ['Body Mass (g)', 'Flipper Length (mm)'], index='Species', aggfunc='mean')

In [33]:
# Show table
pivot_size_table.round(1)

           Body Mass (g)  Flipper Length (mm)
Species
Adelie            3706.2                190.1
Chinstrap         3733.1                195.8
Gentoo            5092.4                217.2

# Notate delete close to final

# This will be big

You can ring AIB phone banking on 0818 724 724 **(Dial +35317712424 from abroad)** anytime to use the automated facility for routine transactions. A customer service advisor is available Monday to Sunday 9am to 5pm for non-routine transactions, or if you need help. You will be required to enter your security details.

- bullets
    - second
- continue bulelts

1. Num bul
1. Num bul 
3. Num bul 

## This will be slightly smaller again  

> AIB Bank is listed on Phonebook. Visit the profile and find the address and phone number of AIB Bank in (Killarney) V93 W995.

### This will be slightly smaller again again 
#### This will be slightly smaller again again again 
##### This will be slightly smaller again again again again 
###### This will be slightly smaller again again again again again